# import numpy as np
# import matplotlib.pyplot as plt
# import pandas as pd

# s1 = pd.DataFrame ({
#     'id' : [1, 2, 3, 4, 5 ,6],
#     'месяц' : ['Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь']})
# s2 = pd.DataFrame ({
#     'id' : [7, 8, 9, 10, 11, 12],
#     'месяц' : ['Июль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь']})
# s3 = pd.DataFrame({
#     'id' : [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
#     'осадки в мм': ['38', '31', '35', '33', '58', '80', '81', '69', '67', '56', '51', '51']})
# s12 = pd.concat([s1, s2])
# # print(s12)
# s123 = pd.merge(s12, s3)
# # print(s123)

 
# import pandas as pd  
# import matplotlib.pyplot as plt 


# df = pd.DataFrame({
#     'id' : [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
#     'месяц' : ['Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь'],
#     'осадки в мм': [38, 31, 35, 33, 58, 80, 81, 69, 67, 56, 51, 51]
# }) 


# df.plot(x="месяц", y="осадки в мм", kind="bar") 
# plt.show()
